Repository: ZeshanFareed/Milk_Adulteration_Detection_System_Using_IOT_and_ML
Catalog: MADS/MADS/locale/*/LC_MESSAGES/django.po
Languages: ur

source: User not authenticated
ur: صارف کی تصدیق نہیں ہوئی

source: User data not found
ur: صارف کا ڈیٹا نہیں ملا

source: Error loading dashboard
ur: ڈیش بورڈ لوڈ کرنے میں خرابی

source: admin
ur: ایڈمنسٹریٹر

source: qc
ur: کوالٹی کنٹرول

source: user
ur: عام صارف

source: Settings reset to default (English language, Asia/Karachi timezone).
ur: ترتیبات کو طے شدہ اقدار پر دوبارہ ترتیب دیا گیا (انگریزی زبان، ایشیا/کراچی ٹائم زون)۔

source: All prediction data cleared successfully.
ur: تمام پیش گوئی کا ڈیٹا کامیابی سے صاف کر دیا گیا۔

source: Error clearing prediction data: {str(e)}
ur: پیش گوئی کا ڈیٹا صاف کرنے میں خرابی: {str(e)}

source: Preferences updated successfully.
ur: ترجیحات کامیابی سے اپ ڈیٹ ہو گئیں۔

source: Error fetching users: {str(e)}
ur: صارفین حاصل کرنے میں خرابی: {str(e)}

source: All fields are required.
ur: تمام فیلڈز درکار ہیں۔

source: Please provide a valid email.
ur: براہ کرم ایک درست ای میل فراہم کریں۔

source: Password must be at least 8 characters long.
ur: پاس ورڈ کم از کم 8 حروف کا ہونا چاہیے۔

source: Passwords must match.
ur: پاس ورڈز مماثل ہونے چاہئیں۔

source: Invalid role selected.
ur: غلط کردار منتخب کیا گیا۔

source: User created successfully.
ur: صارف کامیابی سے بنایا گیا۔

source: An account with this email already exists.
ur: اس ای میل کے ساتھ ایک اکاؤنٹ پہلے سے موجود ہے۔

source: Error creating user: {str(e)}
ur: صارف بنانے میں خرابی: {str(e)}

source: No predictions available in the database.
ur: کوئی پیش گوئیاں ڈیٹا بیس میں دستیاب نہیں ہیں۔

source: No predictions match the applied filters.
ur: فلٹرز کے مطابق کوئی پیش گوئیاں نہیں ملتیں۔

source: Error loading report: {error}
ur: رپورٹ لوڈ کرنے میں خرابی: {error}

source: Milk Adulteration Detection System
ur: دودھ کی ملاوٹ کا پتہ لگانے کا نظام

source: Dashboard
ur: ڈیش بورڈ

source: Reports
ur: رپورٹس

source: User Management
ur: صارفین کا انتظام

source: Settings
ur: ترتیبات

source: Help
ur: مدد

source: Toggle Theme
ur: تھیم تبدیل کریں

source: Logout
ur: لاگ آؤٹ

source: Login
ur: لاگ ان

source: Profile
ur: پروفائل

source: Help & Documentation
ur: مدد اور دستاویزات

source: Getting Started
ur: شروعات

source: Dashboard Guide
ur: ڈیش بورڈ گائیڈ

source: Generating Reports
ur: رپورٹس تیار کرنا

source: Troubleshooting
ur: مسائل کا حل

source: Welcome to the Milk Adulteration Detection System (MADS). This system helps you monitor milk quality and detect adulteration using advanced sensors and machine learning.
ur: دودھ کی ملاوٹ کا پتہ لگانے کے نظام (MADS) میں خوش آمدید۔ یہ نظام جدید سینسرز اور مشین لرننگ کا استعمال کرتے ہوئے دودھ کے معیار کی نگرانی اور ملاوٹ کا پتہ لگانے میں مدد کرتا ہے۔

source: System Requirements
ur: نظام کے تقاضے

source: Modern web browser (Chrome, Firefox, Edge, or Safari)
ur: جدید ویب براؤزر (کروم، فائر فاکس، ایج، یا سفاری)

source: Stable internet connection for real-time data updates
ur: ریئل ٹائم ڈیٹا اپ ڈیٹس کے لیے مستحکم انٹرنیٹ کنکشن

source: Minimum screen resolution of 1024x768
ur: کم از کم سکرین ریزولوشن 1024x768

source: Firebase account for data storage (configured by admin)
ur: ڈیٹا اسٹوریج کے لیے فائر بیس اکاؤنٹ (ایڈمن کے ذریعے ترتیب دیا گیا)

source: First Steps
ur: پہلے اقدامات

source: Sign up or log in using your credentials.
ur: اپنی اسناد کا استعمال کرتے ہوئے سائن اپ یا لاگ ان کریں۔

source: Navigate to the Dashboard to view real-time sensor data.
ur: ریئل ٹائم سینسر ڈیٹا دیکھنے کے لیے ڈیش بورڈ پر جائیں۔

source: Upload a CSV file with sensor data to perform a milk analysis.
ur: دودھ کے تجزیے کے لیے سینسر ڈیٹا کے ساتھ CSV فائل اپ لوڈ کریں۔

source: Check the Reports section for detailed analysis and history.
ur: تفصیلی تجزیہ اور تاریخ کے لیے رپورٹس سیکشن چیک کریں۔

source: Configure preferences in Settings (admin/QC only).
ur: ترتیبات میں ترجیحات ترتیب دیں (صرف ایڈمن/کیو سی کے لیے)۔

source: The dashboard is the central hub for monitoring milk quality parameters and viewing adulteration detection results in real-time.
ur: ڈیش بورڈ دودھ کے معیار کے پیرامیٹرز کی نگرانی اور ملاوٹ کا پتہ لگانے کے نتائج کو ریئل ٹائم میں دیکھنے کا مرکزی مرکز ہے۔

source: Key Components
ur: اہم اجزاء

source: System Overview
ur: نظام کا جائزہ

source: Displays connected sensors, pure/adulterated sample counts, and last detection time.
ur: جڑے ہوئے سینسرز، خالص/ملاوٹ شدہ نمونوں کی تعداد، اور آخری پتہ لگانے کا وقت دکھاتا ہے۔

source: Live Sensor Data
ur: لائیو سینسر ڈیٹا

source: Shows real-time values for parameters like pH, Temperature, and Gas, with CSV upload for additional data.
ur: پی ایچ، درجہ حرارت، اور گیس جیسے پیرامیٹرز کے لیے ریئل ٹائم اقدار دکھاتا ہے، اضافی ڈیٹا کے لیے CSV اپ لوڈ کے ساتھ۔

source: Current Milk Analysis
ur: موجودہ دودھ کا تجزیہ

source: Presents the latest prediction with XAI insights and visual indicators.
ur: تازہ ترین پیش گوئی کو XAI بصیرت اور بصری اشاروں کے ساتھ پیش کرتا ہے۔

source: Real-time Monitoring
ur: ریئل ٹائم نگرانی

source: Line charts tracking pH, Temperature, and Gas trends over time.
ur: وقت کے ساتھ پی ایچ، درجہ حرارت، اور گیس کے رجحانات کو ٹریک کرنے والی لائن چارٹس۔

source: The Reports section allows Quality Control (QC) and Admin users to generate detailed analysis reports in PDF or CSV format.
ur: رپورٹس سیکشن کوالٹی کنٹرول (کیو سی) اور ایڈمن صارفین کو پی ڈی ایف یا CSV فارمیٹ میں تفصیلی تجزیاتی رپورٹس تیار کرنے کی اجازت دیتا ہے۔

source: Steps to Generate Reports
ur: رپورٹس تیار کرنے کے مراحل

source: Navigate to the Reports section (available to Admin/QC roles).
ur: رپورٹس سیکشن پر جائیں (ایڈمن/کیو سی کرداروں کے لیے دستیاب)۔

source: Use the filter form to select a date range or search by prediction type.
ur: تاریخ کی حد منتخب کرنے یا پیش گوئی کی قسم کے ذریعے تلاش کرنے کے لیے فلٹر فارم استعمال کریں۔

source: Click 'Apply Date Filter' to update the results.
ur: نتائج کو اپ ڈیٹ کرنے کے لیے 'تاریخ فلٹر لگائیں' پر کلک کریں۔

source: Choose the export format (PDF or CSV) using the download buttons.
ur: ڈاؤن لوڈ بٹنوں کا استعمال کرتے ہوئے ایکسپورٹ فارمیٹ (پی ڈی ایف یا CSV) منتخب کریں۔

source: Download the report for offline use or sharing.
ur: آف لائن استعمال یا اشتراک کے لیے رپورٹ ڈاؤن لوڈ کریں۔

source: PDF reports include a prediction history table, key factors, and interpretation, while CSV reports provide raw data for further analysis.
ur: پی ڈی ایف رپورٹس میں پیش گوئی کی تاریخ کا جدول، اہم عوامل، اور تشریح شامل ہوتی ہے، جبکہ CSV رپورٹس مزید تجزیہ کے لیے خام ڈیٹا فراہم کرتی ہیں۔

source: Admin users can manage user accounts, including creating, editing, and deleting users, as well as assigning roles.
ur: ایڈمن صارفین صارف اکاؤنٹس کا انتظام کر سکتے ہیں، بشمول صارفین کو بنانا، ترمیم کرنا، اور حذف کرنا، نیز کردار تفویض کرنا۔

source: Managing Users
ur: صارفین کا انتظام

source: Go to the User Management section (Admin only).
ur: صارف انتظامی سیکشن پر جائیں (صرف ایڈمن کے لیے)۔

source: Create a new user by filling out the form with email, password, and role.
ur: ای میل، پاس ورڈ، اور کردار کے ساتھ فارم پُر کرکے نیا صارف بنائیں۔

source: Edit existing users by clicking the edit icon on their card.
ur: موجودہ صارفین کو ان کے کارڈ پر ترمیم آئیکن پر کلک کرکے ترمیم کریں۔

source: Delete users using the delete icon (cannot delete your own account).
ur: حذف آئیکن کا استعمال کرکے صارفین کو حذف کریں (آپ اپنا اکاؤنٹ حذف نہیں کر سکتے)۔

source: Filter users by email, role, or status for easier management.
ur: آسان انتظام کے لیے ای میل، کردار، یا حالت کے ذریعے صارفین کو فلٹر کریں۔

source: Available roles include Administrator (full access), Quality Control (testing/reporting), and Regular User (dashboard access).
ur: دستیاب کرداروں میں ایڈمنسٹریٹر (مکمل رسائی)، کوالٹی کنٹرول (ٹیسٹنگ/رپورٹنگ)، اور باقاعدہ صارف (ڈیش بورڈ رسائی) شامل ہیں۔

source: Common Issues
ur: عام مسائل

source: Login Failure
ur: لاگ ان ناکامی

source: Ensure your email and password are correct. Use the 'Forgot Password' link if needed.
ur: یقینی بنائیں کہ آپ کا ای میل اور پاس ورڈ درست ہیں۔ اگر ضرورت ہو تو 'پاس ورڈ بھول گئے' لنک استعمال کریں۔

source: No Sensor Data
ur: کوئی سینسر ڈیٹا نہیں

source: Check Firebase configuration and ensure sensors are connected. Verify CSV file format.
ur: فائر بیس کنفیگریشن چیک کریں اور یقینی بنائیں کہ سینسرز جڑے ہوئے ہیں۔ CSV فائل فارمیٹ کی تصدیق کریں۔

source: Prediction Errors
ur: پیش گوئی کے نقائص

source: Ensure all required sensor values are provided in the CSV file and within valid ranges.
ur: یقینی بنائیں کہ CSV فائل میں تمام مطلوبہ سینسر اقدار فراہم کی گئی ہیں اور وہ درست حدود میں ہیں۔

source: Report Generation Failure
ur: رپورٹ تیار کرنے میں ناکامی

source: Check date filters and ensure predictions exist in the database.
ur: تاریخ کے فلٹرز چیک کریں اور یقینی بنائیں کہ ڈیٹا بیس میں پیش گوئیاں موجود ہیں۔

source: Slow Performance
ur: سست کارکردگی

source: Clear browser cache or try a different browser. Ensure a stable internet connection.
ur: براؤزر کیش صاف کریں یا مختلف براؤزر آزمائیں۔ مستحکم انٹرنیٹ کنکشن یقینی بنائیں۔

source: Need More Help?
ur: مزید مدد کی ضرورت ہے؟

source: Contact our support team at
ur: ہماری سپورٹ ٹیم سے رابطہ کریں

source: or call
ur: یا کال کریں

source: User Preferences
ur: صارف کی ترجیحات

source: Language
ur: زبان

source: English
ur: انگریزی

source: Urdu
ur: اردو

source: Timezone
ur: ٹائم زون

source: Asia/Karachi
ur: ایشیا/کراچی

source: Europe/London
ur: یورپ/لندن

source: Show Tooltips
ur: ٹول ٹپس دکھائیں

source: Save Preferences
ur: ترجیحات محفوظ کریں

source: Danger Zone
ur: خطرناک زون

source: Reset Settings
ur: ترتیبات دوبارہ ترتیب دیں

source: Reset all settings to their default values.
ur: تمام ترتیبات کو ان کے طے شدہ اقدار پر دوبارہ ترتیب دیں۔

source: Clear Prediction Data
ur: پیش گوئی کا ڈیٹا صاف کریں

source: Permanently delete all prediction data from the database.
ur: ڈیٹا بیس سے تمام پیش گوئی کا ڈیٹا مستقل طور پر حذف کریں۔

source: Clear Data
ur: ڈیٹا صاف کریں

source: Confirm Reset Settings
ur: ترتیبات دوبارہ ترتیب دینے کی تصدیق کریں

source: Are you sure you want to reset all settings to their default values? This action cannot be undone.
ur: کیا آپ واقعی تمام ترتیبات کو ان کے طے شدہ اقدار پر دوبارہ ترتیب دینا چاہتے ہیں؟ اس عمل کو واپس نہیں کیا جا سکتا۔

source: Cancel
ur: منسوخ کریں

source: Confirm Clear Data
ur: ڈیٹا صاف کرنے کی تصدیق کریں

source: Are you sure you want to permanently delete all prediction data? This action cannot be undone.
ur: کیا آپ واقعی تمام پیش گوئی کا ڈیٹا مستقل طور پر حذف کرنا چاہتے ہیں؟ اس عمل کو واپس نہیں کیا جا سکتا۔

source: Edit User
ur: صارف میں ترمیم کریں

source: Email Address
ur: ای میل ایڈریس

source: Password
ur: پاس ورڈ

source: Password is required.
ur: پاس ورڈ درکار ہے۔

source: At least 8 characters with numbers and symbols
ur: کم از کم 8 حروف، نمبروں اور علامات کے ساتھ

source: Confirm Password
ur: پاس ورڈ کی تصدیق کریں

source: User Role
ur: صارف کا کردار

source: Administrator
ur: ایڈمنسٹریٹر

source: Full system access
ur: مکمل سسٹم رسائی

source: Quality Control
ur: کوالٹی کنٹرول

source: Testing and reporting
ur: ٹیسٹنگ اور رپورٹنگ

source: Regular User
ur: عام صارف

source: Basic dashboard access
ur: بنیادی ڈیش بورڈ رسائی

source: Update User
ur: صارف اپ ڈیٹ کریں

source: Create User
ur: صارف بنائیں

source: Search by email...
ur: ای میل کے ذریعے تلاش کریں...

source: All Roles
ur: تمام کردار

source: All Statuses
ur: تمام حالتیں

source: Active
ur: فعال

source: Inactive
ur: غیر فعال

source: Joined
ur: شامل ہوئے

source: Last active
ur: آخری بار فعال

source: Delete User
ur: صارف حذف کریں

source: No users found.
ur: کوئی صارف نہیں ملا۔

source: Are you sure you want to delete
ur: کیا آپ واقعی حذف کرنا چاہتے ہیں

source: This action cannot be undone.
ur: یہ عمل واپس نہیں کیا جا سکتا۔

source: Delete
ur: حذف کریں

source: seconds ago
ur: سیکنڈ پہلے

source: hour
ur: گھنٹہ

source: day
ur: دن

source: minutes
ur: منٹ

source: ago
ur: پہلے

source: Please select a user role.
ur: براہ کرم صارف کا کردار منتخب کریں۔

source: Weak
ur: کمزور

source: Fair
ur: مناسب

source: Good
ur: اچھا

source: Strong
ur: مضبوط

source: Very Strong
ur: بہت مضبوط

source: Never
ur: کبھی نہیں

source: Milk Analysis Report
ur: دودھ کے تجزیے کی رپورٹ

source: Filter Report
ur: رپورٹ فلٹر کریں

source: Apply Date Filter
ur: تاریخ فلٹر لگائیں

source: Prediction History
ur: پیش گوئی کی تاریخ

source: Loading...
ur: لوڈ ہو رہا ہے...

source: No predictions available.
ur: کوئی پیش گوئیاں ڈیٹا بیس میں دستیاب نہیں ہیں۔

source: Adulterated Milk
ur: ملاوٹ شدہ دودھ

source: Key Factors (Latest Prediction)
ur: اہم عوامل (تازہ ترین پیش گوئی)

source: Latest milk adulteration analysis results (Total: {{ count }})
ur: دودھ کی ملاوٹ کے تازہ ترین تجزیاتی نتائج (کل: {{ count }})

source: These parameters had the most significant impact on the latest prediction (%s):
ur: ان پیرامیٹرز کا تازہ ترین پیش گوئی (%s) پر سب سے زیادہ اثر پڑا:

source: No key factors available.
ur: کوئی اہم عوامل دستیاب نہیں ہیں۔

source: Impact: {{ impact }}
ur: اثر: {{ impact }}

source: Download PDF
ur: پی ڈی ایف ڈاؤن لوڈ کریں

source: Download CSV
ur: CSV ڈاؤن لوڈ کریں

source: Error loading predictions. Please try again.
ur: پیش گوئیاں لوڈ کرنے میں خرابی۔ براہ کرم دوبارہ کوشش کریں۔

source: Connected Sensors
ur: منسلک سینسرز

source: Pure Samples
ur: خالص نمونے

source: Adulterated
ur: ملاوٹ شدہ

source: Last Detection
ur: آخری پتہ لگانا

source: Upload CSV File
ur: CSV فائل اپ لوڈ کریں

source: Upload CSV with values in order: Fat, SNF, Gravity, Lactose, Salts, Protein, Added Water, Temperature, Freeze Point, pH, EC
ur: CSV فائل اپ لوڈ کریں جس میں اقدار اس ترتیب سے ہوں: چربی، SNF، گریویٹی، لیکٹوز، نمکیات، پروٹین، اضافی پانی، درجہ حرارت، فریز پوائنٹ، pH، EC

source: Parameter
ur: پیرامیٹر

source: Value
ur: قدر

source: Status
ur: حالت

source: Lactose
ur: لیکٹوز

source: Fat
ur: چربی

source: Protein
ur: پروٹین

source: Gravity
ur: گریویٹی

source: sdagdg
ur: گریویٹی

source: Temperature
ur: درجہ حرارت

source: Gas
ur: گیس

source: Waiting
ur: انتظار کر رہا ہے

source: Milk Sample
ur: دودھ کا نمونہ

source: No data yet
ur: ابھی تک کوئی ڈیٹا نہیں

source: Waiting for data...
ur: ڈیٹا کے انتظار میں...

source: XAI Insights
ur: XAI بصیرت

source: System initializing...
ur: نظام شروع ہو رہا ہے...

source: The system is waiting for the first data sample. Analysis will begin shortly.
ur: نظام پہلے ڈیٹا نمونے کے انتظار میں ہے۔ تجزیہ جلد شروع ہو جائے گا۔

source: Temperature (°C)
ur: درجہ حرارت (°C)

source: No file selected
ur: کوئی فائل منتخب نہیں کی گئی

source: Error
ur: خرابی

source: Error uploading CSV file
ur: CSV فائل اپ لوڈ کرنے میں خرابی

source: Prediction completed
ur: پیشگوئی مکمل ہو گئی

source: Alert
ur: انتباہ

source: Normal
ur: نارمل

source: No feature importance data available
ur: کوئی فیچر کی اہمیت کا ڈیٹا دستیاب نہیں

source: This sample meets all quality standards for pure milk.
ur: یہ نمونہ خالص دودھ کے تمام معیارات پر پورا اترتا ہے۔

source: Urea detected in milk. Urea is added to increase the apparent protein content.
ur: دودھ میں یوریا پایا گیا۔ یوریا ظاہری پروٹین کی مقدار بڑھانے کے لیے شامل کیا جاتا ہے۔

source: Starch detected in milk. Starch is added to increase viscosity and density.
ur: دودھ میں نشاستہ پایا گیا۔ نشاستہ چپچپاہٹ اور کثافت بڑھانے کے لیے شامل کیا جاتا ہے۔

source: Sodium bicarbonate detected. Used to neutralize acidity in spoiled milk.
ur: سوڈیم بائی کاربونیٹ پایا گیا۔ خراب دودھ کی تیزابیت کو ختم کرنے کے لیے استعمال ہوتا ہے۔

source: Maltodextrin detected in milk. Used to artificially increase solid content and density.
ur: دودھ میں مالٹوڈیکسٹرین پایا گیا۔ ٹھوس مواد اور کثافت کو مصنوعی طور پر بڑھانے کے لیے استعمال ہوتا ہے۔

source: Formaldehyde detected. A dangerous preservative added to extend shelf life.
ur: فارملڈہائیڈ پایا گیا۔ شیلف لائف بڑھانے کے لیے ایک خطرناک محافظ شامل کیا گیا۔

source: Excessive water content detected. Milk has been diluted to increase volume.
ur: زیادہ پانی کی مقدار پائی گئی۔ دودھ کو حجم بڑھانے کے لیے پتلا کیا گیا ہے۔

source: The system is analyzing the milk sample.
ur: نظام دودھ کے نمونے کا تجزیہ کر رہا ہے۔

source: Urea Adulteration
ur: یوریا ملاوٹ

source: Starch Adulteration
ur: نشاستہ ملاوٹ

source: Sodium Bicarbonate Adulteration
ur: سوڈیم بائی کاربونیٹ ملاوٹ

source: Maltodextrin Adulteration
ur: مالٹوڈیکسٹرین ملاوٹ

source: Formaldehyde Adulteration
ur: فارملڈہائیڈ ملاوٹ

source: Water Adulteration
ur: پانی کی ملاوٹ
